In [1]:
import numpy as np
import pandas as pd

In [2]:
sozluk1 = {"Isim": ["Ahmet","Mehmet", "Zeynep", "Atıl"],
           "Spor": ["Koşu","Yüzme", "Koşu", "Basketbol"],
           "Kalori": [100,200,300,400]
          }

In [3]:
dataFrame1 = pd.DataFrame(sozluk1, index = [0,1,2,3])

In [4]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [5]:
sozluk2 = {"Isim": ["Osman","Levent", "Atlas", "Fatma"],
           "Spor": ["Koşu","Yüzme", "Koşu", "Basketbol"],
           "Kalori": [200,100,50,300]
          }

In [6]:
dataFrame2 = pd.DataFrame(data=sozluk2, index = [4,5,6,7])

In [7]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [8]:
sozluk3 = {"Isim": ["Ayse","Mahmut", "Duygu", "Nur"],
           "Spor": ["Koşu","Yüzme", "Badminton", "Tenis"],
           "Kalori": [300,400,500,250]
          }

In [9]:
dataFrame3 = pd.DataFrame(sozluk3, index = [8,9,10,11])

In [10]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## concatenation (birleştirme) 
#### isimler farklı kolonlar aynı

In [11]:
x = pd.concat([dataFrame1, dataFrame2, dataFrame3], axis = 0)

In [12]:
x

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

In [13]:
x.set_index = "indexler"

In [14]:
x

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

In [15]:
x.index.name = "index"

In [16]:
x

         Isim       Spor  Kalori
index
0       Ahmet       Koşu     100
1      Mehmet      Yüzme     200
2      Zeynep       Koşu     300
3        Atıl  Basketbol     400
4       Osman       Koşu     200
5      Levent      Yüzme     100
6       Atlas       Koşu      50
7       Fatma  Basketbol     300
8        Ayse       Koşu     300
9      Mahmut      Yüzme     400
10      Duygu  Badminton     500
11        Nur      Tenis     250

## merge
#### isimler aynı kolonlar farklı (aynı isimlere farklı kolonla veri eklemek)(kaynaştırmak)

In [17]:
mergeSozluk1 = {
    "Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
    "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"]
}

In [18]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [19]:
mergeSozluk2 = {
    "Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
    "Kalori" : [100,200,150,250]
}

In [20]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [21]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

### #################################################

In [22]:
maasSozluk = {
    "Isim" : ["Atıl","Zeynep","Mehmet","Ahmet"],
    "Departman" : ["Yazılım", " Satış", "Pazarlama", "Yazılım"],
    "Maas" : [200,300,400,500]
}

In [23]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [24]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [25]:
maasDataFrame["Departman"].unique() # departman türlerini getirir.

array(['Yazılım', ' Satış', 'Pazarlama'], dtype=object)

In [26]:
maasDataFrame["Departman"].nunique() # departman türlerinin sayısı

3

In [27]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Pazarlama    1
 Satış       1
Name: Departman, dtype: int64

In [28]:
def bruttenNete(maas):
    return maas * 0.66

In [29]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [30]:
maasDataFrame.isnull() # değersiz yerler var mı bakmak için

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [31]:
yeniBirVeri = {
    "Karakter Sınıfı" : ["South Park","South Park","Simpson","Simpson"],
    "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart"],
    "Karakter Yas" : [9,10,50,20]
}

In [32]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [33]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [34]:
karakterDF.pivot_table(values = "Karakter Yas", index =  ["Karakter Sınıfı", "Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     20
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [36]:
yeniBirVeri2 = {
    "Karakter Sınıfı" : ["South Park","South Park","Simpson","Simpson","Simpson"],
    "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart","Bart"],
    "Karakter Yas" : [9,10,50,20,10]
}

In [38]:
karakterDF2 = pd.DataFrame(yeniBirVeri2)

In [39]:
karakterDF2.pivot_table(values="Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"])
# Bart için iki deger varken ortalamasını alır

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     15
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [41]:
karakterDF2.pivot_table(values="Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"],aggfunc = np.sum)
# Bart için iki degeri toplar

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10